[
  {
    "name": "Rocky",
    "dialogue": [
      "Hey! Rocky here. I'm excited for this concert!",
      "I'm a big fan of Suzy. I'll make sure to be right at the front of the stage."
    ],
    "items": {
      "Guitar Pedal": {
        "expects": "Autograph",
        "tradeText": "Wow you approached Suzy? How is she upfront? Thank you! Here's that pedal"
      }
    }
  },
  {
    "name": "Suzy",
    "dialogue": [
      "We are going to nail this competition!",
      "What's up? You want an autograph or something?"
    ],
    "items": {
      "Autograph": {
        "tradeText": "Here's that autograph! I did not write it out to anyone, hope that's okay."
      }
    }
  },
  {
    "name": "Larry",
    "dialogue": [
      "I can feel the beat flowing through me.",
      "BA-DA-BOOM BA-DA-BOOM! How's my air-drum solo?"
    ],
    "items": {
      "Drum Sticks": {
        "tradeText": "They're not as good as my own, but a beginner like you could use them."
      }
    }
  },
  {
    "name": "Friend",
    "dialogue": [
      "I'm so glad you made it. Cheer for us out there!",
      "I feel a little intimidated by the other musicians... but I know we're good, too."
    ],
    "items": {
      "VIP Ticket": {
        "tradeText": "Here's the ticket I promised. You should be able to get into the VIP Lounge with it.",
        "tradeLocation": "Info Booth"
      },
      "Key": {
        "tradeText": "Here's the key to my dressing room. Please don't trash it..."
      }
    }
  },
  {
    "name": "Johnny",
    "dialogue": [
      "We're soaring with business today thanks to this event. Hey, what can I get ya?",
      "I've worked here a while, so I am very familiar with the venue. Ask me anything!"
    ],
    "items": {
      "Saxophone Reed": {
        "tradeText": "This one's brand new. I wouldn't give it to just anyone... but you're doing us a favor."
      }
    }
  },
  {
    "name": "Security Guard",
    "dialogue": [
      "Welcome. Please enjoy the show and be mindful of others.",
      "You're here very early. You'll need a VIP ticket if you want to do anything."
    ]
  },
  {
    "name": "Director",
    "dialogue": [
      "I wonder if the instruments will be fixed in time...",
      "Hi, I'm the Director of this venue. Hoping you can enjoy the show later today."
    ]
  }
]